---
kind: type
id: T:Autodesk.Revit.DB.CurveLoopsProfile
source: html/e841c265-7932-3a99-ea0d-a8865e21ca05.htm
---
# Autodesk.Revit.DB.CurveLoopsProfile

Represents a curve loop based profile for sweep or swept blend elements.

## Syntax (C#)
```csharp
public class CurveLoopsProfile : SweepProfile
```

## Remarks
Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory
to create the profile.